org/posts/xlisp.org
#+TITLE: Lisp
#+DATE: 2026-07-02
#+TAGS: Programming
#+DESCRIPTION: A comprehensive C++ guide covering language fundamentals, OOP, templates, modern C++ idioms, memory management, concurrency, performance, tooling, and expert engineering practices.
#+OPTIONS: toc:nil num:nil html-postamble:nil
#+HTML_HEAD: <link rel="stylesheet" href="/static/css/style.css" type="text/css"/>

#+INCLUDE: "../header.org"

#+TITLE: Lisp Q&A — Beginner to Expert
#+AUTHOR: ChatGPT
#+OPTIONS: toc:2 num:t
#+STARTUP: overview

* Lisp Q&A (Beginner - Advanced)

* Beginner (1–50)

** 1) What is Lisp?
 Lisp is a family of programming languages known for simple syntax, symbolic processing, and code-as-data.

*Example:*
#+begin_src lisp
(+ 1 2 3) ; => 6
#+end_src

** 2) Why is Lisp syntax full of parentheses?
Parentheses represent lists, which are the core data structure and syntax form in Lisp.

** 3) What does “code is data” mean in Lisp?
Lisp code is written as lists, and lists are regular data you can manipulate programmatically.

** 4) What is an s-expression?
An s-expression (symbolic expression) is either an atom (number, symbol, string) or a list.

** 5) What is a symbol?
A symbol is an identifier, like ~x~, ~my-function~, or ~+~.

** 6) How do I run Lisp code?
Use a REPL (Read-Eval-Print Loop), such as SBCL REPL, where you type expressions and get immediate results.

** 7) What is the REPL?
An interactive environment that reads input, evaluates it, prints output, and loops.

** 8) What are atoms?
Basic non-list values: numbers, strings, symbols, characters, etc.

** 9) What is a list?
An ordered sequence, written in parentheses.
 
*Example:*
#+begin_src lisp
'(1 2 3) ; a literal list
#+end_src

** 10) Why quote with apostrophe (~'~)?
Quote prevents evaluation and treats expression as literal data.

*Example:*
#+begin_src lisp
'( + 1 2 ) ; list containing symbols and numbers
#+end_src

** 11) What happens without quote?
Lisp tries to evaluate it as code.

*Example:*
#+begin_src lisp
(+ 1 2) ; => 3
#+end_src

** 12) What is ~nil~?
~nil~ means false and also the empty list in Common Lisp.

** 13) What is ~t~?
~t~ is the canonical true value.

** 14) How do I define a variable?
Use ~let~ for local bindings or ~defparameter/~defvar for globals.

*Example:*
#+begin_src lisp
(let ((x 10)) (+ x 5)) ; => 15
#+end_src

** 15) Difference between ~defparameter~ and ~defvar~?
~defparameter~ always assigns; ~defvar~ assigns only if variable is unbound.

** 16) How do I define a function?
Use ~defun~.

*Example:*
#+begin_src lisp
(defun square (x) (* x x))
(square 4) ; => 16
#+end_src

** 17) What is function application syntax?
~(function arg1 arg2 ...)~.

** 18) Are operators like ~+~ functions?
Yes, in Common Lisp arithmetic operators are functions.

** 19) How do conditionals work?
Use ~if~, ~cond~, or ~when/~unless.

*Example:*
#+begin_src lisp
(if (> 5 3) "yes" "no") ; => "yes"
#+end_src

** 20) What is ~cond~?
Multi-branch conditional with test-result clauses.

*Example:*
#+begin_src lisp
(cond ((< x 0) :negative)
      ((= x 0) :zero)
      (t :positive))
#+end_src

** 21) What is lexical scope?
Variables are visible where they are textually defined (and nested inside).

** 22) What is dynamic scope?
Variable resolution based on call chain (special variables in Common Lisp).

** 23) What are special variables?
Dynamically scoped variables, usually named with stars: ~*print-base*~.

** 24) What is ~setq~?
Assigns to an existing variable.

*Example:*
#+begin_src lisp
(let ((x 1))
  (setq x 9)
  x) ; => 9
#+end_src

** 25) What is ~setf~?
Generalized assignment to many “places” (variables, array slots, object fields).

*Example:*
#+begin_src lisp
(setf (car my-list) 42)
#+end_src

** 26) What are ~car~ and ~cdr~?
~car~ returns first element; ~cdr~ returns rest of list.

*Example:*
#+begin_src lisp
(car '(a b c)) ; => A
(cdr '(a b c)) ; => (B C)
#+end_src

** 27) What is ~cons~?
Constructs a new cons cell from head and tail.

*Example:*
#+begin_src lisp
(cons 'a '(b c)) ; => (A B C)
#+end_src

** 28) What is a cons cell?
A pair of pointers: first part and rest part; lists are chains of cons cells.

** 29) How do I check types?
Use predicates like ~numberp~, ~symbolp~, ~listp~, ~stringp~.

