public/posts/xlisp.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lisp Lisp Q&amp;A — Beginner to Expert</title>
<meta name="description" content="A comprehensive C++ guide covering language fundamentals, OOP, templates, modern C++ idioms, memory management, concurrency, performance, tooling, and expert engineering practices." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/static/css/style.css" type="text/css"/>
<link rel="stylesheet" href="/static/css/style.css" type="text/css"/>
<link rel="stylesheet" href="/static/css/style.css" type="text/css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Lisp Lisp Q&amp;A — Beginner to Expert</h1>
</header><div class="site-header">
  <div class="site-title"><a href="/">Borislav Dostumski</a></div>
  <nav class="site-nav">
    <a href="/index.html">Index</a>
    <a href="/certificates.html">Certificates</a>
    <a href="/blog.html">Blog</a>
    <a href="/about.html">Bio</a>
  </nav>
</div>
<div id="outline-container-org15efbda" class="outline-2">
<h2 id="org15efbda">Lisp Q&amp;A (Beginner - Advanced)</h2>
</div>

<div id="outline-container-org9902fdd" class="outline-2">
<h2 id="org9902fdd">Beginner (1–50)</h2>
<div class="outline-text-2" id="text-org9902fdd">
</div>
<div id="outline-container-orge91f45b" class="outline-3">
<h3 id="orge91f45b">1) What is Lisp?</h3>
<div class="outline-text-3" id="text-orge91f45b">
<p>
Lisp is a family of programming languages known for simple syntax, symbolic processing, and code-as-data.
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(+ 1 2 3) <span style="font-weight: bold; font-style: italic;">; =&gt; 6</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org002846e" class="outline-3">
<h3 id="org002846e">2) Why is Lisp syntax full of parentheses?</h3>
<div class="outline-text-3" id="text-org002846e">
<p>
Parentheses represent lists, which are the core data structure and syntax form in Lisp.
</p>
</div>
</div>
<div id="outline-container-org34e216b" class="outline-3">
<h3 id="org34e216b">3) What does “code is data” mean in Lisp?</h3>
<div class="outline-text-3" id="text-org34e216b">
<p>
Lisp code is written as lists, and lists are regular data you can manipulate programmatically.
</p>
</div>
</div>
<div id="outline-container-orgafb17cc" class="outline-3">
<h3 id="orgafb17cc">4) What is an s-expression?</h3>
<div class="outline-text-3" id="text-orgafb17cc">
<p>
An s-expression (symbolic expression) is either an atom (number, symbol, string) or a list.
</p>
</div>
</div>
<div id="outline-container-org8160680" class="outline-3">
<h3 id="org8160680">5) What is a symbol?</h3>
<div class="outline-text-3" id="text-org8160680">
<p>
A symbol is an identifier, like <code>x</code>, <code>my-function</code>, or <code>+</code>.
</p>
</div>
</div>
<div id="outline-container-orge5917ac" class="outline-3">
<h3 id="orge5917ac">6) How do I run Lisp code?</h3>
<div class="outline-text-3" id="text-orge5917ac">
<p>
Use a REPL (Read-Eval-Print Loop), such as SBCL REPL, where you type expressions and get immediate results.
</p>
</div>
</div>
<div id="outline-container-org0292996" class="outline-3">
<h3 id="org0292996">7) What is the REPL?</h3>
<div class="outline-text-3" id="text-org0292996">
<p>
An interactive environment that reads input, evaluates it, prints output, and loops.
</p>
</div>
</div>
<div id="outline-container-org3f681ed" class="outline-3">
<h3 id="org3f681ed">8) What are atoms?</h3>
<div class="outline-text-3" id="text-org3f681ed">
<p>
Basic non-list values: numbers, strings, symbols, characters, etc.
</p>
</div>
</div>
<div id="outline-container-orga2bb43e" class="outline-3">
<h3 id="orga2bb43e">9) What is a list?</h3>
<div class="outline-text-3" id="text-orga2bb43e">
<p>
An ordered sequence, written in parentheses.
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">'(1 2 3) <span style="font-weight: bold; font-style: italic;">; a literal list</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd7d26d4" class="outline-3">
<h3 id="orgd7d26d4">10) Why quote with apostrophe (<code>'</code>)?</h3>
<div class="outline-text-3" id="text-orgd7d26d4">
<p>
Quote prevents evaluation and treats expression as literal data.
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">'( + 1 2 ) <span style="font-weight: bold; font-style: italic;">; list containing symbols and numbers</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2a8ff6d" class="outline-3">
<h3 id="org2a8ff6d">11) What happens without quote?</h3>
<div class="outline-text-3" id="text-org2a8ff6d">
<p>
Lisp tries to evaluate it as code.
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(+ 1 2) <span style="font-weight: bold; font-style: italic;">; =&gt; 3</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org3cb21c6" class="outline-3">
<h3 id="org3cb21c6">12) What is <code>nil</code>?</h3>
<div class="outline-text-3" id="text-org3cb21c6">
<p>
<code>nil</code> means false and also the empty list in Common Lisp.
</p>
</div>
</div>
<div id="outline-container-org4fb5769" class="outline-3">
<h3 id="org4fb5769">13) What is <code>t</code>?</h3>
<div class="outline-text-3" id="text-org4fb5769">
<p>
<code>t</code> is the canonical true value.
</p>
</div>
</div>
<div id="outline-container-org7b7e9e6" class="outline-3">
<h3 id="org7b7e9e6">14) How do I define a variable?</h3>
<div class="outline-text-3" id="text-org7b7e9e6">
<p>
Use <code>let</code> for local bindings or ~defparameter/~defvar for globals.
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">let</span> ((x 10)) (+ x 5)) <span style="font-weight: bold; font-style: italic;">; =&gt; 15</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7b245cf" class="outline-3">
<h3 id="org7b245cf">15) Difference between <code>defparameter</code> and <code>defvar</code>?</h3>
<div class="outline-text-3" id="text-org7b245cf">
<p>
<code>defparameter</code> always assigns; <code>defvar</code> assigns only if variable is unbound.
</p>
</div>
</div>
<div id="outline-container-org794e505" class="outline-3">
<h3 id="org794e505">16) How do I define a function?</h3>
<div class="outline-text-3" id="text-org794e505">
<p>
Use <code>defun</code>.
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">square</span> (x) (* x x))
(square 4) <span style="font-weight: bold; font-style: italic;">; =&gt; 16</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2cbf4f8" class="outline-3">
<h3 id="org2cbf4f8">17) What is function application syntax?</h3>
<div class="outline-text-3" id="text-org2cbf4f8">
<p>
<code>(function arg1 arg2 ...)</code>.
</p>
</div>
</div>
<div id="outline-container-orge5eea5f" class="outline-3">
<h3 id="orge5eea5f">18) Are operators like <code>+</code> functions?</h3>
<div class="outline-text-3" id="text-orge5eea5f">
<p>
Yes, in Common Lisp arithmetic operators are functions.
</p>
</div>
</div>
<div id="outline-container-org562062c" class="outline-3">
<h3 id="org562062c">19) How do conditionals work?</h3>
<div class="outline-text-3" id="text-org562062c">
<p>
Use <code>if</code>, <code>cond</code>, or ~when/~unless.
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">if</span> (&gt; 5 3) <span style="font-style: italic;">"yes"</span> <span style="font-style: italic;">"no"</span>) <span style="font-weight: bold; font-style: italic;">; =&gt; "yes"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgab2c558" class="outline-3">
<h3 id="orgab2c558">20) What is <code>cond</code>?</h3>
<div class="outline-text-3" id="text-orgab2c558">
<p>
Multi-branch conditional with test-result clauses.
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">cond</span> ((&lt; x 0) <span style="font-weight: bold;">:negative</span>)
      ((= x 0) <span style="font-weight: bold;">:zero</span>)
      (t <span style="font-weight: bold;">:positive</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcbee50c" class="outline-3">
<h3 id="orgcbee50c">21) What is lexical scope?</h3>
<div class="outline-text-3" id="text-orgcbee50c">
<p>
Variables are visible where they are textually defined (and nested inside).
</p>
</div>
</div>
<div id="outline-container-org7ada167" class="outline-3">
<h3 id="org7ada167">22) What is dynamic scope?</h3>
<div class="outline-text-3" id="text-org7ada167">
<p>
Variable resolution based on call chain (special variables in Common Lisp).
</p>
</div>
</div>
<div id="outline-container-orgfe3bb30" class="outline-3">
<h3 id="orgfe3bb30">23) What are special variables?</h3>
<div class="outline-text-3" id="text-orgfe3bb30">
<p>
Dynamically scoped variables, usually named with stars: <code>*print-base*</code>.
</p>
</div>
</div>
<div id="outline-container-orgeafdbcd" class="outline-3">
<h3 id="orgeafdbcd">24) What is <code>setq</code>?</h3>
<div class="outline-text-3" id="text-orgeafdbcd">
<p>
Assigns to an existing variable.
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">let</span> ((x 1))
  (setq x 9)
  x) <span style="font-weight: bold; font-style: italic;">; =&gt; 9</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd99f6b1" class="outline-3">
<h3 id="orgd99f6b1">25) What is <code>setf</code>?</h3>
<div class="outline-text-3" id="text-orgd99f6b1">
<p>
Generalized assignment to many “places” (variables, array slots, object fields).
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(setf (car my-list) 42)
</pre>
</div>
</div>
</div>
<div id="outline-container-org426736b" class="outline-3">
<h3 id="org426736b">26) What are <code>car</code> and <code>cdr</code>?</h3>
<div class="outline-text-3" id="text-org426736b">
<p>
<code>car</code> returns first element; <code>cdr</code> returns rest of list.
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(car '(a b c)) <span style="font-weight: bold; font-style: italic;">; =&gt; A
</span>(cdr '(a b c)) <span style="font-weight: bold; font-style: italic;">; =&gt; (B C)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org762fccb" class="outline-3">
<h3 id="org762fccb">27) What is <code>cons</code>?</h3>
<div class="outline-text-3" id="text-org762fccb">
<p>
Constructs a new cons cell from head and tail.
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(cons 'a '(b c)) <span style="font-weight: bold; font-style: italic;">; =&gt; (A B C)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0c4e8af" class="outline-3">
<h3 id="org0c4e8af">28) What is a cons cell?</h3>
<div class="outline-text-3" id="text-org0c4e8af">
<p>
A pair of pointers: first part and rest part; lists are chains of cons cells.
</p>
</div>
</div>
<div id="outline-container-orgf45d537" class="outline-3">
<h3 id="orgf45d537">29) How do I check types?</h3>
<div class="outline-text-3" id="text-orgf45d537">
<p>
Use predicates like <code>numberp</code>, <code>symbolp</code>, <code>listp</code>, <code>stringp</code>.
</p>
</div>
</div>
