org/posts/xlisp.org
** 30) What are predicates?
Functions returning truth values, often ending in ~p~.

** 31) How do I loop?
Use ~loop~, ~dolist~, ~dotimes~, recursion, or mapping functions.

** 32) What is ~dolist~?
Iterates over list elements.

*Example:*
#+begin_src lisp
(dolist (x '(1 2 3))
  (format t "~A " x))
#+end_src

** 33) What is ~dotimes~?
Repeats a fixed number of times.
 
*Example:*
#+begin_src lisp
(dotimes (i 3) (print i))
#+end_src

** 34) What is recursion?
Function calling itself with smaller input until a base case.

** 35) Example of recursion?
*Example:*
#+begin_src lisp
(defun fact (n)
  (if (<= n 1) 1 (* n (fact (- n 1)))))
#+end_src

** 36) What is tail recursion?
Recursive call is final operation; can be optimized in some Lisps (not guaranteed in Common Lisp).

** 37) How do I print output?
Use ~format~.

*Example:*
#+begin_src lisp
(format t "Hello, ~A!~%" "Lisp")
#+end_src

** 38) Difference between ~print~, ~princ~, and ~prin1~?
~print~ adds newline and escapes; ~prin1~ readable representation; ~princ~ user-friendly display.

** 39) How do I make strings?
Use double quotes: ~"hello"~.

** 40) How do I concatenate strings?
Use ~concatenate~.
 
*Example:*
#+begin_src lisp
(concatenate 'string "Hello, " "world")
#+end_src

** 41) How do I compare numbers?
Use ~=~, ~<~, ~>~, ~<=~, ~>=~.

** 42) How do I compare symbols/objects?
Use ~eq~, ~eql~, ~equal~, or ~equalp~ depending on semantics.

** 43) Difference: ~eq~, ~eql~, ~equal~, ~equalp~?
Increasingly deep/permissive equality checks; ~equalp~ is most lenient.

** 44) What is a keyword?
A self-evaluating symbol in ~KEYWORD~ package, written like ~:name~.

** 45) What is a property list (plist)?
Flat key-value list: ~(:name "Ana" :age 30)~.

** 46) How do I access plist values?
Use ~getf~.

*Example:*
#+begin_src lisp
(getf '(:name "Ana" :age 30) :age) ; => 30
#+end_src

** 47) What is an association list (alist)?
List of key-value pairs, each pair typically a cons cell.

** 48) What is ~lambda~?
Anonymous function expression.

*Example:*
#+begin_src lisp
(funcall (lambda (x) (+ x 10)) 5) ; => 15
#+end_src

** 49) What does ~funcall~ do?
Calls a function object with arguments.

** 50) What does ~apply~ do?
Calls a function with argument list where last arg is a list.

*Example:*
#+begin_src lisp
(apply #'+ '(1 2 3 4)) ; => 10
#+end_src

* Intermediate (51–100)

** 51) What is a package in Common Lisp?
Namespace for symbols to avoid naming conflicts.

** 52) How do I define a package?
With ~defpackage~, then ~in-package~.

** 53) What is ~:use~ in packages?
Imports external symbols from other packages (commonly ~:cl~).

** 54) What is shadowing?
Creating a local symbol with same name as imported one.

** 55) How do I write modules/files?
Organize code into packages/files and load with ASDF systems.

** 56) What is ASDF?
Build/load system for Common Lisp projects.

** 57) What is Quicklisp?
Package manager/distribution for Common Lisp libraries.

** 58) What are multiple return values?
A function can return several values, not just one.

*Example:*
#+begin_src lisp
(floor 7 3) ; => 2, 1
#+end_src

** 59) How do I capture multiple values?
Use ~multiple-value-bind~.

*Example:*
#+begin_src lisp
(multiple-value-bind (q r) (floor 7 3)
  (list q r)) ; => (2 1)
#+end_src

** 60) What is ~values~?
Explicitly returns multiple values.

** 61) What is destructuring?
Binding parts of structured data (lists) to variables.

** 62) Example of destructuring in args?
*Example:*
#+begin_src lisp
(defun sum-pair ((a b)) (+ a b)) ; implementation-dependent style
#+end_src

(Usually use destructuring-bind explicitly.)

** 63) What is ~destructuring-bind~?
Binds variables to list structure.

*Example:*
#+begin_src lisp
(destructuring-bind (a b &optional c) '(1 2 3)
  (+ a b c))
#+end_src

** 64) What are optional arguments?
~&optional~ parameters may be omitted.

** 65) What are rest arguments?
~&rest~ gathers remaining args into a list.

