public/posts/xlisp.html
<div id="outline-container-org5eb0135" class="outline-3">
<h3 id="org5eb0135">30) What are predicates?</h3>
<div class="outline-text-3" id="text-org5eb0135">
<p>
Functions returning truth values, often ending in <code>p</code>.
</p>
</div>
</div>
<div id="outline-container-orge34447c" class="outline-3">
<h3 id="orge34447c">31) How do I loop?</h3>
<div class="outline-text-3" id="text-orge34447c">
<p>
Use <code>loop</code>, <code>dolist</code>, <code>dotimes</code>, recursion, or mapping functions.
</p>
</div>
</div>
<div id="outline-container-org132b62e" class="outline-3">
<h3 id="org132b62e">32) What is <code>dolist</code>?</h3>
<div class="outline-text-3" id="text-org132b62e">
<p>
Iterates over list elements.
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">dolist</span> (x '(1 2 3))
  (format t <span style="font-style: italic;">"~A "</span> x))
</pre>
</div>
</div>
</div>
<div id="outline-container-org45917b8" class="outline-3">
<h3 id="org45917b8">33) What is <code>dotimes</code>?</h3>
<div class="outline-text-3" id="text-org45917b8">
<p>
Repeats a fixed number of times.
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">dotimes</span> (i 3) (print i))
</pre>
</div>
</div>
</div>
<div id="outline-container-org11f9ab4" class="outline-3">
<h3 id="org11f9ab4">34) What is recursion?</h3>
<div class="outline-text-3" id="text-org11f9ab4">
<p>
Function calling itself with smaller input until a base case.
</p>
</div>
</div>
<div id="outline-container-org44dee51" class="outline-3">
<h3 id="org44dee51">35) Example of recursion?</h3>
<div class="outline-text-3" id="text-org44dee51">
<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">fact</span> (n)
  (<span style="font-weight: bold;">if</span> (&lt;= n 1) 1 (* n (fact (- n 1)))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgad6fe05" class="outline-3">
<h3 id="orgad6fe05">36) What is tail recursion?</h3>
<div class="outline-text-3" id="text-orgad6fe05">
<p>
Recursive call is final operation; can be optimized in some Lisps (not guaranteed in Common Lisp).
</p>
</div>
</div>
<div id="outline-container-org900abe8" class="outline-3">
<h3 id="org900abe8">37) How do I print output?</h3>
<div class="outline-text-3" id="text-org900abe8">
<p>
Use <code>format</code>.
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(format t <span style="font-style: italic;">"Hello, ~A!~%"</span> <span style="font-style: italic;">"Lisp"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org04fe98b" class="outline-3">
<h3 id="org04fe98b">38) Difference between <code>print</code>, <code>princ</code>, and <code>prin1</code>?</h3>
<div class="outline-text-3" id="text-org04fe98b">
<p>
<code>print</code> adds newline and escapes; <code>prin1</code> readable representation; <code>princ</code> user-friendly display.
</p>
</div>
</div>
<div id="outline-container-org632a53f" class="outline-3">
<h3 id="org632a53f">39) How do I make strings?</h3>
<div class="outline-text-3" id="text-org632a53f">
<p>
Use double quotes: <code>"hello"</code>.
</p>
</div>
</div>
<div id="outline-container-orgc3858c3" class="outline-3">
<h3 id="orgc3858c3">40) How do I concatenate strings?</h3>
<div class="outline-text-3" id="text-orgc3858c3">
<p>
Use <code>concatenate</code>.
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(concatenate 'string <span style="font-style: italic;">"Hello, "</span> <span style="font-style: italic;">"world"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org4778356" class="outline-3">
<h3 id="org4778356">41) How do I compare numbers?</h3>
<div class="outline-text-3" id="text-org4778356">
<p>
Use <code>=</code>, <code>&lt;</code>, <code>&gt;</code>, <code>&lt;=</code>, <code>&gt;=</code>.
</p>
</div>
</div>
<div id="outline-container-org6dfaff3" class="outline-3">
<h3 id="org6dfaff3">42) How do I compare symbols/objects?</h3>
<div class="outline-text-3" id="text-org6dfaff3">
<p>
Use <code>eq</code>, <code>eql</code>, <code>equal</code>, or <code>equalp</code> depending on semantics.
</p>
</div>
</div>
<div id="outline-container-org5131c82" class="outline-3">
<h3 id="org5131c82">43) Difference: <code>eq</code>, <code>eql</code>, <code>equal</code>, <code>equalp</code>?</h3>
<div class="outline-text-3" id="text-org5131c82">
<p>
Increasingly deep/permissive equality checks; <code>equalp</code> is most lenient.
</p>
</div>
</div>
<div id="outline-container-org3dbd2c5" class="outline-3">
<h3 id="org3dbd2c5">44) What is a keyword?</h3>
<div class="outline-text-3" id="text-org3dbd2c5">
<p>
A self-evaluating symbol in <code>KEYWORD</code> package, written like <code>:name</code>.
</p>
</div>
</div>
<div id="outline-container-org5ba179d" class="outline-3">
<h3 id="org5ba179d">45) What is a property list (plist)?</h3>
<div class="outline-text-3" id="text-org5ba179d">
<p>
Flat key-value list: <code>(:name "Ana" :age 30)</code>.
</p>
</div>
</div>
<div id="outline-container-org0608fb8" class="outline-3">
<h3 id="org0608fb8">46) How do I access plist values?</h3>
<div class="outline-text-3" id="text-org0608fb8">
<p>
Use <code>getf</code>.
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(getf '(<span style="font-weight: bold;">:name</span> <span style="font-style: italic;">"Ana"</span> <span style="font-weight: bold;">:age</span> 30) <span style="font-weight: bold;">:age</span>) <span style="font-weight: bold; font-style: italic;">; =&gt; 30</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org58469cd" class="outline-3">
<h3 id="org58469cd">47) What is an association list (alist)?</h3>
<div class="outline-text-3" id="text-org58469cd">
<p>
List of key-value pairs, each pair typically a cons cell.
</p>
</div>
</div>
<div id="outline-container-org1bcec48" class="outline-3">
<h3 id="org1bcec48">48) What is <code>lambda</code>?</h3>
<div class="outline-text-3" id="text-org1bcec48">
<p>
Anonymous function expression.
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(funcall (<span style="font-weight: bold;">lambda</span> (x) (+ x 10)) 5) <span style="font-weight: bold; font-style: italic;">; =&gt; 15</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org65ff523" class="outline-3">
<h3 id="org65ff523">49) What does <code>funcall</code> do?</h3>
<div class="outline-text-3" id="text-org65ff523">
<p>
Calls a function object with arguments.
</p>
</div>
</div>
<div id="outline-container-org3333565" class="outline-3">
<h3 id="org3333565">50) What does <code>apply</code> do?</h3>
<div class="outline-text-3" id="text-org3333565">
<p>
Calls a function with argument list where last arg is a list.
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(apply #'+ '(1 2 3 4)) <span style="font-weight: bold; font-style: italic;">; =&gt; 10</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org10f7595" class="outline-2">
<h2 id="org10f7595">Intermediate (51–100)</h2>
<div class="outline-text-2" id="text-org10f7595">
</div>
<div id="outline-container-org3578307" class="outline-3">
<h3 id="org3578307">51) What is a package in Common Lisp?</h3>
<div class="outline-text-3" id="text-org3578307">
<p>
Namespace for symbols to avoid naming conflicts.
</p>
</div>
</div>
<div id="outline-container-org62090f3" class="outline-3">
<h3 id="org62090f3">52) How do I define a package?</h3>
<div class="outline-text-3" id="text-org62090f3">
<p>
With <code>defpackage</code>, then <code>in-package</code>.
</p>
</div>
</div>
<div id="outline-container-org314010e" class="outline-3">
<h3 id="org314010e">53) What is <code>:use</code> in packages?</h3>
<div class="outline-text-3" id="text-org314010e">
<p>
Imports external symbols from other packages (commonly <code>:cl</code>).
</p>
</div>
</div>
<div id="outline-container-org88e60cf" class="outline-3">
<h3 id="org88e60cf">54) What is shadowing?</h3>
<div class="outline-text-3" id="text-org88e60cf">
<p>
Creating a local symbol with same name as imported one.
</p>
</div>
</div>
<div id="outline-container-org1b920d2" class="outline-3">
<h3 id="org1b920d2">55) How do I write modules/files?</h3>
<div class="outline-text-3" id="text-org1b920d2">
<p>
Organize code into packages/files and load with ASDF systems.
</p>
</div>
</div>
<div id="outline-container-org8ad8530" class="outline-3">
<h3 id="org8ad8530">56) What is ASDF?</h3>
<div class="outline-text-3" id="text-org8ad8530">
<p>
Build/load system for Common Lisp projects.
</p>
</div>
</div>
<div id="outline-container-org03cdb9d" class="outline-3">
<h3 id="org03cdb9d">57) What is Quicklisp?</h3>
<div class="outline-text-3" id="text-org03cdb9d">
<p>
Package manager/distribution for Common Lisp libraries.
</p>
</div>
</div>
<div id="outline-container-org6db09d2" class="outline-3">
<h3 id="org6db09d2">58) What are multiple return values?</h3>
<div class="outline-text-3" id="text-org6db09d2">
<p>
A function can return several values, not just one.
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(floor 7 3) <span style="font-weight: bold; font-style: italic;">; =&gt; 2, 1</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfbaf8c4" class="outline-3">
<h3 id="orgfbaf8c4">59) How do I capture multiple values?</h3>
<div class="outline-text-3" id="text-orgfbaf8c4">
<p>
Use <code>multiple-value-bind</code>.
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">multiple-value-bind</span> (q r) (floor 7 3)
  (list q r)) <span style="font-weight: bold; font-style: italic;">; =&gt; (2 1)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaa62c92" class="outline-3">
<h3 id="orgaa62c92">60) What is <code>values</code>?</h3>
<div class="outline-text-3" id="text-orgaa62c92">
<p>
Explicitly returns multiple values.
</p>
</div>
</div>
<div id="outline-container-orgd333e7e" class="outline-3">
<h3 id="orgd333e7e">61) What is destructuring?</h3>
<div class="outline-text-3" id="text-orgd333e7e">
<p>
Binding parts of structured data (lists) to variables.
</p>
</div>
</div>
<div id="outline-container-org98cdfbe" class="outline-3">
<h3 id="org98cdfbe">62) Example of destructuring in args?</h3>
<div class="outline-text-3" id="text-org98cdfbe">
<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">sum-pair</span> ((a b)) (+ a b)) <span style="font-weight: bold; font-style: italic;">; implementation-dependent style</span>
</pre>
</div>

<p>
(Usually use destructuring-bind explicitly.)
</p>
</div>
</div>
<div id="outline-container-orgac2f28f" class="outline-3">
<h3 id="orgac2f28f">63) What is <code>destructuring-bind</code>?</h3>
<div class="outline-text-3" id="text-orgac2f28f">
<p>
Binds variables to list structure.
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">destructuring-bind</span> (a b <span style="font-weight: bold; text-decoration: underline;">&amp;optional</span> c) '(1 2 3)
  (+ a b c))
</pre>
</div>
</div>
</div>
<div id="outline-container-org0124daa" class="outline-3">
<h3 id="org0124daa">64) What are optional arguments?</h3>
<div class="outline-text-3" id="text-org0124daa">
<p>
<code>&amp;optional</code> parameters may be omitted.
</p>
</div>
</div>
<div id="outline-container-orgadafc7f" class="outline-3">
<h3 id="orgadafc7f">65) What are rest arguments?</h3>
<div class="outline-text-3" id="text-orgadafc7f">
<p>
<code>&amp;rest</code> gathers remaining args into a list.
</p>
</div>
</div>
