org/posts/xlisp.org
** 66) What are keyword arguments?
~&key~ named args like ~:verbose t~.

** 67) What is ~&aux~?
Declares local auxiliary variables in parameter list.

** 68) What is ~mapcar~?
Applies function to each list element, returns list.

*Example:*
#+begin_src lisp
(mapcar #'1+ '(1 2 3)) ; => (2 3 4)
#+end_src

** 69) Difference: ~mapcar~ vs ~dolist~?
~mapcar~ builds result list; ~dolist~ is usually for side effects.

** 70) What is ~reduce~?
Combines sequence elements with binary function.

*Example:*
#+begin_src lisp
(reduce #'+ '(1 2 3 4)) ; => 10
#+end_src

** 71) What is ~remove-if~?
Returns sequence removing elements matching predicate.

** 72) What is ~find-if~?
Returns first element satisfying predicate.

** 73) What is ~sort~?
Destructively sorts sequence.

*Example:*
#+begin_src lisp
(sort (copy-list '(3 1 2)) #'<) ; => (1 2 3)
#+end_src

** 74) Why copy before ~sort~?
~sort~ may mutate original sequence.

** 75) What is hash table?
Key-value structure with fast average lookup.

** 76) How to create hash table?
*Example:*
#+begin_src lisp
(defparameter *h* (make-hash-table :test 'equal))
(setf (gethash "name" *h*) "Lisp")
#+end_src

** 77) What does ~gethash~ return?
Value and a boolean for presence.

** 78) What are arrays/vectors?
Indexed sequences; vectors are 1D arrays.

** 79) How to make vector?
*Example:*
#+begin_src lisp
(make-array 3 :initial-contents '(10 20 30))
#+end_src

** 80) What is adjustable array?
Array that can change size with ~adjust-array~.

** 81) What are fill pointers?
Logical length for vectors supporting efficient append-like behavior.

** 82) What is a structure (~defstruct~)?
Lightweight user-defined record type.

** 83) Example ~defstruct~?
*Example:*
#+begin_src lisp
(defstruct person name age)
(make-person :name "Ana" :age 30)
#+end_src

** 84) What is CLOS?
Common Lisp Object System: classes, generic functions, methods, multimethod dispatch.

** 85) Class vs structure?
Classes are more dynamic/extensible; structures are lightweight/faster for simple records.

** 86) What is ~defclass~?
Defines a class.

** 87) What is ~defmethod~?
Defines method on generic function based on parameter specializers.

** 88) What is multimethod dispatch?
Method selection based on types of multiple arguments.

** 89) What is method combination?
Combining ~:before~, primary, ~:after~, ~:around~ methods.

** 90) What is ~slot-value~?
Accesses object slot dynamically (less encapsulated than accessors).

** 91) What are accessors?
Functions generated for slot read/write access.

** 92) What are conditions in Lisp?
Lisp error/signaling system with restarts and handlers.

** 93) Difference exception vs condition system?
Lisp allows recovery strategies (restarts), not only unwind-and-abort.

** 94) What is ~handler-case~?
Handles signaled conditions similarly to try/catch.

** 95) What is ~ignore-errors~?
Catches errors and returns nil + condition.

** 96) What is a restart?
Named recovery action that can continue execution from error context.

** 97) What is ~unwind-protect~?
Ensures cleanup code runs even on non-local exits.

** 98) What are declarations?
Hints to compiler (types, optimization qualities).

** 99) What is ~proclaim~/~declaim~?
Global declarations affecting compilation/runtime behavior.

** 100) How to optimize performance?
Add type declarations, reduce consing, profile, and tune algorithms/data structures.

* Advanced (101–150)

** 101) What is a macro?
A compile-time code transformer from input forms to output forms.

** 102) Why use macros?
Create new syntactic abstractions and eliminate boilerplate elegantly.

** 103) Macro vs function?
Functions evaluate arguments first; macros receive raw forms.

** 104) How to define macro?
*Example:*
#+begin_src lisp
(defmacro when-not (test &body body)
  `(if (not ,test) (progn ,@body)))
#+end_src

** 105) What is backquote (~`~)?
Template syntax for building lists with selective evaluation.

