public/posts/xlisp.html
<div id="outline-container-org9546521" class="outline-3">
<h3 id="org9546521">66) What are keyword arguments?</h3>
<div class="outline-text-3" id="text-org9546521">
<p>
<code>&amp;key</code> named args like <code>:verbose t</code>.
</p>
</div>
</div>
<div id="outline-container-org1895925" class="outline-3">
<h3 id="org1895925">67) What is <code>&amp;aux</code>?</h3>
<div class="outline-text-3" id="text-org1895925">
<p>
Declares local auxiliary variables in parameter list.
</p>
</div>
</div>
<div id="outline-container-orga088379" class="outline-3">
<h3 id="orga088379">68) What is <code>mapcar</code>?</h3>
<div class="outline-text-3" id="text-orga088379">
<p>
Applies function to each list element, returns list.
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(mapcar #'1+ '(1 2 3)) <span style="font-weight: bold; font-style: italic;">; =&gt; (2 3 4)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org75049b1" class="outline-3">
<h3 id="org75049b1">69) Difference: <code>mapcar</code> vs <code>dolist</code>?</h3>
<div class="outline-text-3" id="text-org75049b1">
<p>
<code>mapcar</code> builds result list; <code>dolist</code> is usually for side effects.
</p>
</div>
</div>
<div id="outline-container-org2f0a9c9" class="outline-3">
<h3 id="org2f0a9c9">70) What is <code>reduce</code>?</h3>
<div class="outline-text-3" id="text-org2f0a9c9">
<p>
Combines sequence elements with binary function.
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(reduce #'+ '(1 2 3 4)) <span style="font-weight: bold; font-style: italic;">; =&gt; 10</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgace2525" class="outline-3">
<h3 id="orgace2525">71) What is <code>remove-if</code>?</h3>
<div class="outline-text-3" id="text-orgace2525">
<p>
Returns sequence removing elements matching predicate.
</p>
</div>
</div>
<div id="outline-container-org5c4ce59" class="outline-3">
<h3 id="org5c4ce59">72) What is <code>find-if</code>?</h3>
<div class="outline-text-3" id="text-org5c4ce59">
<p>
Returns first element satisfying predicate.
</p>
</div>
</div>
<div id="outline-container-org39ba727" class="outline-3">
<h3 id="org39ba727">73) What is <code>sort</code>?</h3>
<div class="outline-text-3" id="text-org39ba727">
<p>
Destructively sorts sequence.
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(sort (copy-list '(3 1 2)) #'&lt;) <span style="font-weight: bold; font-style: italic;">; =&gt; (1 2 3)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org44bef51" class="outline-3">
<h3 id="org44bef51">74) Why copy before <code>sort</code>?</h3>
<div class="outline-text-3" id="text-org44bef51">
<p>
<code>sort</code> may mutate original sequence.
</p>
</div>
</div>
<div id="outline-container-org92831c2" class="outline-3">
<h3 id="org92831c2">75) What is hash table?</h3>
<div class="outline-text-3" id="text-org92831c2">
<p>
Key-value structure with fast average lookup.
</p>
</div>
</div>
<div id="outline-container-org86e191c" class="outline-3">
<h3 id="org86e191c">76) How to create hash table?</h3>
<div class="outline-text-3" id="text-org86e191c">
<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">defparameter</span> <span style="font-weight: bold; font-style: italic;">*h*</span> (make-hash-table <span style="font-weight: bold;">:test</span> 'equal))
(setf (gethash <span style="font-style: italic;">"name"</span> *h*) <span style="font-style: italic;">"Lisp"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org74e65cb" class="outline-3">
<h3 id="org74e65cb">77) What does <code>gethash</code> return?</h3>
<div class="outline-text-3" id="text-org74e65cb">
<p>
Value and a boolean for presence.
</p>
</div>
</div>
<div id="outline-container-org0d3610e" class="outline-3">
<h3 id="org0d3610e">78) What are arrays/vectors?</h3>
<div class="outline-text-3" id="text-org0d3610e">
<p>
Indexed sequences; vectors are 1D arrays.
</p>
</div>
</div>
<div id="outline-container-org7c8a618" class="outline-3">
<h3 id="org7c8a618">79) How to make vector?</h3>
<div class="outline-text-3" id="text-org7c8a618">
<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(make-array 3 <span style="font-weight: bold;">:initial-contents</span> '(10 20 30))
</pre>
</div>
</div>
</div>
<div id="outline-container-org6d324fe" class="outline-3">
<h3 id="org6d324fe">80) What is adjustable array?</h3>
<div class="outline-text-3" id="text-org6d324fe">
<p>
Array that can change size with <code>adjust-array</code>.
</p>
</div>
</div>
<div id="outline-container-org023c385" class="outline-3">
<h3 id="org023c385">81) What are fill pointers?</h3>
<div class="outline-text-3" id="text-org023c385">
<p>
Logical length for vectors supporting efficient append-like behavior.
</p>
</div>
</div>
<div id="outline-container-orgbe2f385" class="outline-3">
<h3 id="orgbe2f385">82) What is a structure (<code>defstruct</code>)?</h3>
<div class="outline-text-3" id="text-orgbe2f385">
<p>
Lightweight user-defined record type.
</p>
</div>
</div>
<div id="outline-container-org9ebb685" class="outline-3">
<h3 id="org9ebb685">83) Example <code>defstruct</code>?</h3>
<div class="outline-text-3" id="text-org9ebb685">
<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">defstruct</span> <span style="font-weight: bold; text-decoration: underline;">person</span> name age)
(make-person <span style="font-weight: bold;">:name</span> <span style="font-style: italic;">"Ana"</span> <span style="font-weight: bold;">:age</span> 30)
</pre>
</div>
</div>
</div>
<div id="outline-container-org3818870" class="outline-3">
<h3 id="org3818870">84) What is CLOS?</h3>
<div class="outline-text-3" id="text-org3818870">
<p>
Common Lisp Object System: classes, generic functions, methods, multimethod dispatch.
</p>
</div>
</div>
<div id="outline-container-orged1f779" class="outline-3">
<h3 id="orged1f779">85) Class vs structure?</h3>
<div class="outline-text-3" id="text-orged1f779">
<p>
Classes are more dynamic/extensible; structures are lightweight/faster for simple records.
</p>
</div>
</div>
<div id="outline-container-orgc50341e" class="outline-3">
<h3 id="orgc50341e">86) What is <code>defclass</code>?</h3>
<div class="outline-text-3" id="text-orgc50341e">
<p>
Defines a class.
</p>
</div>
</div>
<div id="outline-container-org9425750" class="outline-3">
<h3 id="org9425750">87) What is <code>defmethod</code>?</h3>
<div class="outline-text-3" id="text-org9425750">
<p>
Defines method on generic function based on parameter specializers.
</p>
</div>
</div>
<div id="outline-container-org400ec41" class="outline-3">
<h3 id="org400ec41">88) What is multimethod dispatch?</h3>
<div class="outline-text-3" id="text-org400ec41">
<p>
Method selection based on types of multiple arguments.
</p>
</div>
</div>
<div id="outline-container-org6164417" class="outline-3">
<h3 id="org6164417">89) What is method combination?</h3>
<div class="outline-text-3" id="text-org6164417">
<p>
Combining <code>:before</code>, primary, <code>:after</code>, <code>:around</code> methods.
</p>
</div>
</div>
<div id="outline-container-org1f5ad84" class="outline-3">
<h3 id="org1f5ad84">90) What is <code>slot-value</code>?</h3>
<div class="outline-text-3" id="text-org1f5ad84">
<p>
Accesses object slot dynamically (less encapsulated than accessors).
</p>
</div>
</div>
<div id="outline-container-orge99af59" class="outline-3">
<h3 id="orge99af59">91) What are accessors?</h3>
<div class="outline-text-3" id="text-orge99af59">
<p>
Functions generated for slot read/write access.
</p>
</div>
</div>
<div id="outline-container-org903c466" class="outline-3">
<h3 id="org903c466">92) What are conditions in Lisp?</h3>
<div class="outline-text-3" id="text-org903c466">
<p>
Lisp error/signaling system with restarts and handlers.
</p>
</div>
</div>
<div id="outline-container-org99fc3bc" class="outline-3">
<h3 id="org99fc3bc">93) Difference exception vs condition system?</h3>
<div class="outline-text-3" id="text-org99fc3bc">
<p>
Lisp allows recovery strategies (restarts), not only unwind-and-abort.
</p>
</div>
</div>
<div id="outline-container-orgaf7a703" class="outline-3">
<h3 id="orgaf7a703">94) What is <code>handler-case</code>?</h3>
<div class="outline-text-3" id="text-orgaf7a703">
<p>
Handles signaled conditions similarly to try/catch.
</p>
</div>
</div>
<div id="outline-container-orge62c12a" class="outline-3">
<h3 id="orge62c12a">95) What is <code>ignore-errors</code>?</h3>
<div class="outline-text-3" id="text-orge62c12a">
<p>
Catches errors and returns nil + condition.
</p>
</div>
</div>
<div id="outline-container-orgd030d9f" class="outline-3">
<h3 id="orgd030d9f">96) What is a restart?</h3>
<div class="outline-text-3" id="text-orgd030d9f">
<p>
Named recovery action that can continue execution from error context.
</p>
</div>
</div>
<div id="outline-container-org8494e7d" class="outline-3">
<h3 id="org8494e7d">97) What is <code>unwind-protect</code>?</h3>
<div class="outline-text-3" id="text-org8494e7d">
<p>
Ensures cleanup code runs even on non-local exits.
</p>
</div>
</div>
<div id="outline-container-org3a7c75a" class="outline-3">
<h3 id="org3a7c75a">98) What are declarations?</h3>
<div class="outline-text-3" id="text-org3a7c75a">
<p>
Hints to compiler (types, optimization qualities).
</p>
</div>
</div>
<div id="outline-container-org6ec4531" class="outline-3">
<h3 id="org6ec4531">99) What is <code>proclaim~/~declaim</code>?</h3>
<div class="outline-text-3" id="text-org6ec4531">
<p>
Global declarations affecting compilation/runtime behavior.
</p>
</div>
</div>
<div id="outline-container-org322ee6a" class="outline-3">
<h3 id="org322ee6a">100) How to optimize performance?</h3>
<div class="outline-text-3" id="text-org322ee6a">
<p>
Add type declarations, reduce consing, profile, and tune algorithms/data structures.
</p>
</div>
</div>
</div>
<div id="outline-container-org44294bf" class="outline-2">
<h2 id="org44294bf">Advanced (101–150)</h2>
<div class="outline-text-2" id="text-org44294bf">
</div>
<div id="outline-container-org45444f7" class="outline-3">
<h3 id="org45444f7">101) What is a macro?</h3>
<div class="outline-text-3" id="text-org45444f7">
<p>
A compile-time code transformer from input forms to output forms.
</p>
</div>
</div>
<div id="outline-container-org4ef0b38" class="outline-3">
<h3 id="org4ef0b38">102) Why use macros?</h3>
<div class="outline-text-3" id="text-org4ef0b38">
<p>
Create new syntactic abstractions and eliminate boilerplate elegantly.
</p>
</div>
</div>
<div id="outline-container-org3e29030" class="outline-3">
<h3 id="org3e29030">103) Macro vs function?</h3>
<div class="outline-text-3" id="text-org3e29030">
<p>
Functions evaluate arguments first; macros receive raw forms.
</p>
</div>
</div>
<div id="outline-container-org1d12d4a" class="outline-3">
<h3 id="org1d12d4a">104) How to define macro?</h3>
<div class="outline-text-3" id="text-org1d12d4a">
<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">defmacro</span> <span style="font-weight: bold;">when-not</span> (test <span style="font-weight: bold; text-decoration: underline;">&amp;body</span> body)
  `(<span style="font-weight: bold;">if</span> (not ,test) (<span style="font-weight: bold;">progn</span> ,@body)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org2fad81e" class="outline-3">
<h3 id="org2fad81e">105) What is backquote (<code>`</code>)?</h3>
<div class="outline-text-3" id="text-org2fad81e">
<p>
Template syntax for building lists with selective evaluation.
</p>
</div>
</div>
