org/posts/xlisp.org
** 106) What do comma (~,~) and comma-at (~,@~) do?
~,~ inserts value; ~,@~ splices list elements.

** 107) What is macro expansion?
Resulting code after macro transforms input.

*Example:*
#+begin_src lisp
(macroexpand-1 '(when-not x (print "hi")))
#+end_src

** 108) What is macro hygiene?
Avoiding accidental variable capture/name collisions in macro-generated code.

** 109) How avoid variable capture?
Use ~gensym~ for unique temporary symbols.

** 110) What is symbol capture?
Macro-introduced symbol accidentally binds/conflicts with user symbol.

** 111) What are compiler macros?
Optional source transformations for function calls to optimize compiled code.

** 112) What is reader macro?
Extends read syntax (at read-time), e.g., quote shorthand.

** 113) Why are reader macros powerful/dangerous?
Can improve DSL syntax but reduce readability/tool compatibility.

** 114) What is eval?
Evaluates Lisp form at runtime in dynamic environment contexts.

** 115) Why avoid excessive ~eval~?
Harder reasoning, security/performance/debugging costs.

** 116) What is closure?
Function capturing lexical variables from defining environment.

*Example:*
#+begin_src lisp
(defun make-counter ()
  (let ((n 0))
    (lambda () (incf n))))
#+end_src

** 117) What is lexical environment?
Bindings visible where function/macro is defined.

** 118) What is dynamic environment?
Runtime context for special variables, handlers, restarts.

** 119) What is continuation (conceptually)?
“Rest of computation” from a point; explicit first-class continuations are not standard CL.

** 120) What is non-local exit?
Control transfer out of current context (~throw~, ~return-from~, errors).

** 121) What are ~catch~ and ~throw~?
Tagged non-local control transfer constructs.

** 122) What is block/return-from?
Named lexical exit points.

** 123) What is ~tagbody/go~?
Low-level goto-like flow constructs.

** 124) What is MOP?
Metaobject Protocol for customizing CLOS behavior (implementation-dependent).

** 125) What is method dispatch cost?
Runtime overhead of selecting applicable method(s); often acceptable, sometimes optimizable.

** 126) What is generic function redefinition impact?
Can update behavior interactively in running image.

** 127) What is image-based development?
Long-lived Lisp process where definitions are incrementally reloaded.

** 128) What are fasl files?
Compiled Lisp binary artifacts loaded faster than source.

** 129) compile-file vs load?
~compile-file~ produces fasl; ~load~ loads source or fasl.

** 130) What is separate compilation?
Compiling modules independently with clear package interfaces.

** 131) What is foreign function interface (FFI)?
Mechanism to call C/native libraries from Lisp.

** 132) Common FFI caveats?
Memory ownership, ABI compatibility, struct layout, threading boundaries.

** 133) What is bignum support?
 Arbitrary-precision integers built into Common Lisp numeric tower.

** 134) What is numeric tower?
 Hierarchy: integers, rationals, reals, complex numbers.

** 135) Why are ratios useful?
 Exact rational arithmetic avoids floating-point rounding where possible.

** 136) How does coercion work?
 Use ~coerce~ or numeric contagion rules in operations.

** 137) What are readtables?
 Reader syntax configuration tables.

** 138) What is pretty printing?
 Structured formatted output via printer control and pprint facilities.

** 139) What is introspection in Lisp?
 Querying runtime metadata: function definitions, classes, packages, etc.

** 140) What is reflection?
 Inspecting/modifying program structure/behavior at runtime.

** 141) What is disassemble?
 Inspect compiled machine code for functions (implementation-dependent detail).

** 142) What is profiling?
 Measuring time/allocation hot spots for optimization.

** 143) What is allocation pressure (consing)?
 Frequent temporary object creation causing GC overhead.

** 144) How reduce consing?
 Reuse structures, destructive ops carefully, better algorithms, declarations.

** 145) What is garbage collection tuning?
 Adjust implementation-specific GC parameters for workload.

** 146) What is weak hash table?
 Entries can disappear when keys/values are no longer strongly referenced.

** 147) What is memoization idiom?
 Cache function results (often hash table keyed by args).

** 148) What is DSL in Lisp?
 Domain-specific language built naturally with macros and reader extensions.

