public/posts/xlisp.html
<div id="outline-container-org3a20c79" class="outline-3">
<h3 id="org3a20c79">106) What do comma (<code>,</code>) and comma-at (<code>,@</code>) do?</h3>
<div class="outline-text-3" id="text-org3a20c79">
<p>
<code>,</code> inserts value; <code>,@</code> splices list elements.
</p>
</div>
</div>
<div id="outline-container-org59cd1de" class="outline-3">
<h3 id="org59cd1de">107) What is macro expansion?</h3>
<div class="outline-text-3" id="text-org59cd1de">
<p>
Resulting code after macro transforms input.
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(macroexpand-1 '(when-not x (print <span style="font-style: italic;">"hi"</span>)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org6bab04b" class="outline-3">
<h3 id="org6bab04b">108) What is macro hygiene?</h3>
<div class="outline-text-3" id="text-org6bab04b">
<p>
Avoiding accidental variable capture/name collisions in macro-generated code.
</p>
</div>
</div>
<div id="outline-container-org7f04b4d" class="outline-3">
<h3 id="org7f04b4d">109) How avoid variable capture?</h3>
<div class="outline-text-3" id="text-org7f04b4d">
<p>
Use <code>gensym</code> for unique temporary symbols.
</p>
</div>
</div>
<div id="outline-container-org763c7e6" class="outline-3">
<h3 id="org763c7e6">110) What is symbol capture?</h3>
<div class="outline-text-3" id="text-org763c7e6">
<p>
Macro-introduced symbol accidentally binds/conflicts with user symbol.
</p>
</div>
</div>
<div id="outline-container-orgaaea121" class="outline-3">
<h3 id="orgaaea121">111) What are compiler macros?</h3>
<div class="outline-text-3" id="text-orgaaea121">
<p>
Optional source transformations for function calls to optimize compiled code.
</p>
</div>
</div>
<div id="outline-container-orga8b4cd5" class="outline-3">
<h3 id="orga8b4cd5">112) What is reader macro?</h3>
<div class="outline-text-3" id="text-orga8b4cd5">
<p>
Extends read syntax (at read-time), e.g., quote shorthand.
</p>
</div>
</div>
<div id="outline-container-org52a631c" class="outline-3">
<h3 id="org52a631c">113) Why are reader macros powerful/dangerous?</h3>
<div class="outline-text-3" id="text-org52a631c">
<p>
Can improve DSL syntax but reduce readability/tool compatibility.
</p>
</div>
</div>
<div id="outline-container-org06d388f" class="outline-3">
<h3 id="org06d388f">114) What is eval?</h3>
<div class="outline-text-3" id="text-org06d388f">
<p>
Evaluates Lisp form at runtime in dynamic environment contexts.
</p>
</div>
</div>
<div id="outline-container-org4dad256" class="outline-3">
<h3 id="org4dad256">115) Why avoid excessive <code>eval</code>?</h3>
<div class="outline-text-3" id="text-org4dad256">
<p>
Harder reasoning, security/performance/debugging costs.
</p>
</div>
</div>
<div id="outline-container-org7abe686" class="outline-3">
<h3 id="org7abe686">116) What is closure?</h3>
<div class="outline-text-3" id="text-org7abe686">
<p>
Function capturing lexical variables from defining environment.
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">make-counter</span> ()
  (<span style="font-weight: bold;">let</span> ((n 0))
    (<span style="font-weight: bold;">lambda</span> () (incf n))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd6955f1" class="outline-3">
<h3 id="orgd6955f1">117) What is lexical environment?</h3>
<div class="outline-text-3" id="text-orgd6955f1">
<p>
Bindings visible where function/macro is defined.
</p>
</div>
</div>
<div id="outline-container-org7901220" class="outline-3">
<h3 id="org7901220">118) What is dynamic environment?</h3>
<div class="outline-text-3" id="text-org7901220">
<p>
Runtime context for special variables, handlers, restarts.
</p>
</div>
</div>
<div id="outline-container-org8fa17ab" class="outline-3">
<h3 id="org8fa17ab">119) What is continuation (conceptually)?</h3>
<div class="outline-text-3" id="text-org8fa17ab">
<p>
“Rest of computation” from a point; explicit first-class continuations are not standard CL.
</p>
</div>
</div>
<div id="outline-container-org94ca073" class="outline-3">
<h3 id="org94ca073">120) What is non-local exit?</h3>
<div class="outline-text-3" id="text-org94ca073">
<p>
Control transfer out of current context (<code>throw</code>, <code>return-from</code>, errors).
</p>
</div>
</div>
<div id="outline-container-orga43fbd0" class="outline-3">
<h3 id="orga43fbd0">121) What are <code>catch</code> and <code>throw</code>?</h3>
<div class="outline-text-3" id="text-orga43fbd0">
<p>
Tagged non-local control transfer constructs.
</p>
</div>
</div>
<div id="outline-container-orgec7e288" class="outline-3">
<h3 id="orgec7e288">122) What is block/return-from?</h3>
<div class="outline-text-3" id="text-orgec7e288">
<p>
Named lexical exit points.
</p>
</div>
</div>
<div id="outline-container-orgf101550" class="outline-3">
<h3 id="orgf101550">123) What is <code>tagbody/go</code>?</h3>
<div class="outline-text-3" id="text-orgf101550">
<p>
Low-level goto-like flow constructs.
</p>
</div>
</div>
<div id="outline-container-org9a4d8ba" class="outline-3">
<h3 id="org9a4d8ba">124) What is MOP?</h3>
<div class="outline-text-3" id="text-org9a4d8ba">
<p>
Metaobject Protocol for customizing CLOS behavior (implementation-dependent).
</p>
</div>
</div>
<div id="outline-container-orga836de9" class="outline-3">
<h3 id="orga836de9">125) What is method dispatch cost?</h3>
<div class="outline-text-3" id="text-orga836de9">
<p>
Runtime overhead of selecting applicable method(s); often acceptable, sometimes optimizable.
</p>
</div>
</div>
<div id="outline-container-org6167547" class="outline-3">
<h3 id="org6167547">126) What is generic function redefinition impact?</h3>
<div class="outline-text-3" id="text-org6167547">
<p>
Can update behavior interactively in running image.
</p>
</div>
</div>
<div id="outline-container-org90f49e9" class="outline-3">
<h3 id="org90f49e9">127) What is image-based development?</h3>
<div class="outline-text-3" id="text-org90f49e9">
<p>
Long-lived Lisp process where definitions are incrementally reloaded.
</p>
</div>
</div>
<div id="outline-container-orgd8df90f" class="outline-3">
<h3 id="orgd8df90f">128) What are fasl files?</h3>
<div class="outline-text-3" id="text-orgd8df90f">
<p>
Compiled Lisp binary artifacts loaded faster than source.
</p>
</div>
</div>
<div id="outline-container-org00df7f3" class="outline-3">
<h3 id="org00df7f3">129) compile-file vs load?</h3>
<div class="outline-text-3" id="text-org00df7f3">
<p>
<code>compile-file</code> produces fasl; <code>load</code> loads source or fasl.
</p>
</div>
</div>
<div id="outline-container-orge3620be" class="outline-3">
<h3 id="orge3620be">130) What is separate compilation?</h3>
<div class="outline-text-3" id="text-orge3620be">
<p>
Compiling modules independently with clear package interfaces.
</p>
</div>
</div>
<div id="outline-container-org404e5b9" class="outline-3">
<h3 id="org404e5b9">131) What is foreign function interface (FFI)?</h3>
<div class="outline-text-3" id="text-org404e5b9">
<p>
Mechanism to call C/native libraries from Lisp.
</p>
</div>
</div>
<div id="outline-container-org6846d93" class="outline-3">
<h3 id="org6846d93">132) Common FFI caveats?</h3>
<div class="outline-text-3" id="text-org6846d93">
<p>
Memory ownership, ABI compatibility, struct layout, threading boundaries.
</p>
</div>
</div>
<div id="outline-container-org46f8398" class="outline-3">
<h3 id="org46f8398">133) What is bignum support?</h3>
<div class="outline-text-3" id="text-org46f8398">
<p>
Arbitrary-precision integers built into Common Lisp numeric tower.
</p>
</div>
</div>
<div id="outline-container-orgc2cc72e" class="outline-3">
<h3 id="orgc2cc72e">134) What is numeric tower?</h3>
<div class="outline-text-3" id="text-orgc2cc72e">
<p>
Hierarchy: integers, rationals, reals, complex numbers.
</p>
</div>
</div>
<div id="outline-container-org3069d7e" class="outline-3">
<h3 id="org3069d7e">135) Why are ratios useful?</h3>
<div class="outline-text-3" id="text-org3069d7e">
<p>
Exact rational arithmetic avoids floating-point rounding where possible.
</p>
</div>
</div>
<div id="outline-container-orgebb82d8" class="outline-3">
<h3 id="orgebb82d8">136) How does coercion work?</h3>
<div class="outline-text-3" id="text-orgebb82d8">
<p>
Use <code>coerce</code> or numeric contagion rules in operations.
</p>
</div>
</div>
<div id="outline-container-org0177196" class="outline-3">
<h3 id="org0177196">137) What are readtables?</h3>
<div class="outline-text-3" id="text-org0177196">
<p>
Reader syntax configuration tables.
</p>
</div>
</div>
<div id="outline-container-orgf6bdac6" class="outline-3">
<h3 id="orgf6bdac6">138) What is pretty printing?</h3>
<div class="outline-text-3" id="text-orgf6bdac6">
<p>
Structured formatted output via printer control and pprint facilities.
</p>
</div>
</div>
<div id="outline-container-org7040e05" class="outline-3">
<h3 id="org7040e05">139) What is introspection in Lisp?</h3>
<div class="outline-text-3" id="text-org7040e05">
<p>
Querying runtime metadata: function definitions, classes, packages, etc.
</p>
</div>
</div>
<div id="outline-container-org1523b5a" class="outline-3">
<h3 id="org1523b5a">140) What is reflection?</h3>
<div class="outline-text-3" id="text-org1523b5a">
<p>
Inspecting/modifying program structure/behavior at runtime.
</p>
</div>
</div>
<div id="outline-container-orga42ec48" class="outline-3">
<h3 id="orga42ec48">141) What is disassemble?</h3>
<div class="outline-text-3" id="text-orga42ec48">
<p>
Inspect compiled machine code for functions (implementation-dependent detail).
</p>
</div>
</div>
<div id="outline-container-org69c1c0e" class="outline-3">
<h3 id="org69c1c0e">142) What is profiling?</h3>
<div class="outline-text-3" id="text-org69c1c0e">
<p>
Measuring time/allocation hot spots for optimization.
</p>
</div>
</div>
<div id="outline-container-org05b12b4" class="outline-3">
<h3 id="org05b12b4">143) What is allocation pressure (consing)?</h3>
<div class="outline-text-3" id="text-org05b12b4">
<p>
Frequent temporary object creation causing GC overhead.
</p>
</div>
</div>
<div id="outline-container-org9a43d0e" class="outline-3">
<h3 id="org9a43d0e">144) How reduce consing?</h3>
<div class="outline-text-3" id="text-org9a43d0e">
<p>
Reuse structures, destructive ops carefully, better algorithms, declarations.
</p>
</div>
</div>
<div id="outline-container-org36b5034" class="outline-3">
<h3 id="org36b5034">145) What is garbage collection tuning?</h3>
<div class="outline-text-3" id="text-org36b5034">
<p>
Adjust implementation-specific GC parameters for workload.
</p>
</div>
</div>
<div id="outline-container-orgbf4ad5d" class="outline-3">
<h3 id="orgbf4ad5d">146) What is weak hash table?</h3>
<div class="outline-text-3" id="text-orgbf4ad5d">
<p>
Entries can disappear when keys/values are no longer strongly referenced.
</p>
</div>
</div>
<div id="outline-container-org520f035" class="outline-3">
<h3 id="org520f035">147) What is memoization idiom?</h3>
<div class="outline-text-3" id="text-org520f035">
<p>
Cache function results (often hash table keyed by args).
</p>
</div>
</div>
<div id="outline-container-org4b7ba1a" class="outline-3">
<h3 id="org4b7ba1a">148) What is DSL in Lisp?</h3>
<div class="outline-text-3" id="text-org4b7ba1a">
<p>
Domain-specific language built naturally with macros and reader extensions.
</p>
</div>
</div>
