public/posts/xlisp.html
<div id="outline-container-orge4477f3" class="outline-3">
<h3 id="orge4477f3">149) What is staging (compile-time/runtime split)?</h3>
<div class="outline-text-3" id="text-orge4477f3">
<p>
Deciding what computations happen during macro expansion vs runtime.
</p>
</div>
</div>
<div id="outline-container-org4459e3a" class="outline-3">
<h3 id="org4459e3a">150) What is “Lisp style”?</h3>
<div class="outline-text-3" id="text-org4459e3a">
<p>
Data-driven design, small composable functions, macros for abstractions, interactive development.
</p>
</div>
</div>
</div>
<div id="outline-container-orgd674bfa" class="outline-2">
<h2 id="orgd674bfa">Expert (151–180)</h2>
<div class="outline-text-2" id="text-orgd674bfa">
</div>
<div id="outline-container-org2be3eb3" class="outline-3">
<h3 id="org2be3eb3">151) How do I design robust macros for large systems?</h3>
<div class="outline-text-3" id="text-org2be3eb3">
<p>
Keep macro surface minimal, expand into simple primitives, document expansion contracts, and test macroexpansions.
</p>
</div>
</div>
<div id="outline-container-org6512302" class="outline-3">
<h3 id="org6512302">152) When should I <b>not</b> use a macro?</h3>
<div class="outline-text-3" id="text-org6512302">
<p>
If a function (or higher-order function) is enough; prefer simpler runtime abstractions first.
</p>
</div>
</div>
<div id="outline-container-org17c6395" class="outline-3">
<h3 id="org17c6395">153) How do I version macro APIs safely?</h3>
<div class="outline-text-3" id="text-org17c6395">
<p>
Preserve old expansion behavior when possible; provide compatibility layers and deprecation phases.
</p>
</div>
</div>
<div id="outline-container-orge2a62a1" class="outline-3">
<h3 id="orge2a62a1">154) What is phase separation risk in macros?</h3>
<div class="outline-text-3" id="text-orge2a62a1">
<p>
Confusing compile-time and runtime dependencies can break builds/load order.
</p>
</div>
</div>
<div id="outline-container-orgfc4906d" class="outline-3">
<h3 id="orgfc4906d">155) How to manage compile-time side effects?</h3>
<div class="outline-text-3" id="text-orgfc4906d">
<p>
Avoid unless necessary; isolate with <code>eval-when</code> and clear module boundaries.
</p>
</div>
</div>
<div id="outline-container-org13e7843" class="outline-3">
<h3 id="org13e7843">156) What is <code>eval-when</code> for?</h3>
<div class="outline-text-3" id="text-org13e7843">
<p>
Controls when forms are evaluated: compile-toplevel, load-toplevel, execute.
</p>
</div>
</div>
<div id="outline-container-org8a0a799" class="outline-3">
<h3 id="org8a0a799">157) How can declarations backfire?</h3>
<div class="outline-text-3" id="text-org8a0a799">
<p>
Incorrect type/safety claims may cause undefined behavior or hard-to-debug bugs.
</p>
</div>
</div>
<div id="outline-container-orgc59135f" class="outline-3">
<h3 id="orgc59135f">158) What optimization policy is common?</h3>
<div class="outline-text-3" id="text-orgc59135f">
<p>
During development: high debug/safety; production hotspots: higher speed with validated assumptions.
</p>
</div>
</div>
<div id="outline-container-org1915a8c" class="outline-3">
<h3 id="org1915a8c">159) How do I benchmark Lisp correctly?</h3>
<div class="outline-text-3" id="text-org1915a8c">
<p>
Warm up, avoid measuring compilation, isolate GC effects, run multiple trials, report variance.
</p>
</div>
</div>
<div id="outline-container-orgadef4ff" class="outline-3">
<h3 id="orgadef4ff">160) How to reason about GC pauses?</h3>
<div class="outline-text-3" id="text-orgadef4ff">
<p>
Track allocation rate, object lifetimes, heap sizing, and generation behavior of implementation.
</p>
</div>
</div>
<div id="outline-container-org58b95a7" class="outline-3">
<h3 id="org58b95a7">161) How do I design stable package APIs?</h3>
<div class="outline-text-3" id="text-org58b95a7">
<p>
Export minimal symbols, keep internals private, provide clear compatibility guarantees.
</p>
</div>
</div>
<div id="outline-container-orgb9dc9a4" class="outline-3">
<h3 id="orgb9dc9a4">162) How do I avoid package conflicts in ecosystems?</h3>
<div class="outline-text-3" id="text-orgb9dc9a4">
<p>
Use explicit imports, qualified symbols, and avoid overly generic exported names.
</p>
</div>
</div>
<div id="outline-container-orgbcb14c3" class="outline-3">
<h3 id="orgbcb14c3">163) What is protocol-oriented design in CLOS?</h3>
<div class="outline-text-3" id="text-orgbcb14c3">
<p>
Define generic operations and behavioral contracts rather than rigid class trees.
</p>
</div>
</div>
<div id="outline-container-org3d30892" class="outline-3">
<h3 id="org3d30892">164) CLOS vs algebraic data types (tradeoff)?</h3>
<div class="outline-text-3" id="text-org3d30892">
<p>
CLOS excels in open extension; ADTs excel in closed exhaustive pattern handling.
</p>
</div>
</div>
<div id="outline-container-org019b3be" class="outline-3">
<h3 id="org019b3be">165) How to structure large Common Lisp systems?</h3>
<div class="outline-text-3" id="text-org019b3be">
<p>
Layered ASDF systems, strict package boundaries, integration tests, and development image scripts.
</p>
</div>
</div>
<div id="outline-container-orgda4af11" class="outline-3">
<h3 id="orgda4af11">166) How to reload code safely in live systems?</h3>
<div class="outline-text-3" id="text-orgda4af11">
<p>
Minimize global mutable state, version migrations for object slots, and controlled restart workflows.
</p>
</div>
</div>
<div id="outline-container-orgf47b335" class="outline-3">
<h3 id="orgf47b335">167) What are class redefinition pitfalls?</h3>
<div class="outline-text-3" id="text-orgf47b335">
<p>
Existing instances require updates; slot changes may need migration logic.
</p>
</div>
</div>
<div id="outline-container-orga71abc2" class="outline-3">
<h3 id="orga71abc2">168) How to implement plugin architectures?</h3>
<div class="outline-text-3" id="text-orga71abc2">
<p>
Use generic functions, registries, packages, and capability-based protocols.
</p>
</div>
</div>
<div id="outline-container-org80f6770" class="outline-3">
<h3 id="org80f6770">169) How to build debuggable DSLs?</h3>
<div class="outline-text-3" id="text-org80f6770">
<p>
Preserve source locations where possible, keep expansions readable, provide macroexpand tooling.
</p>
</div>
</div>
<div id="outline-container-org8ede943" class="outline-3">
<h3 id="org8ede943">170) Reader macros in production: yes or no?</h3>
<div class="outline-text-3" id="text-org8ede943">
<p>
Use sparingly; prefer plain macros unless syntax gain clearly outweighs tooling/readability costs.
</p>
</div>
</div>
<div id="outline-container-orgd891d43" class="outline-3">
<h3 id="orgd891d43">171) How to integrate Lisp with polyglot systems?</h3>
<div class="outline-text-3" id="text-orgd891d43">
<p>
Define clear service boundaries (RPC/HTTP/message bus), stable schemas, and observability hooks.
</p>
</div>
</div>
<div id="outline-container-orge1c91a4" class="outline-3">
<h3 id="orge1c91a4">172) How do restarts improve resilience?</h3>
<div class="outline-text-3" id="text-orge1c91a4">
<p>
They enable interactive or programmatic recovery strategies without full failure teardown.
</p>
</div>
</div>
<div id="outline-container-orgab238ab" class="outline-3">
<h3 id="orgab238ab">173) How to design condition hierarchies?</h3>
<div class="outline-text-3" id="text-orgab238ab">
<p>
Create specific condition types for actionable handling; avoid overly generic error signaling.
</p>
</div>
</div>
<div id="outline-container-org5e6cfc9" class="outline-3">
<h3 id="org5e6cfc9">174) How to audit for undefined behavior risks?</h3>
<div class="outline-text-3" id="text-org5e6cfc9">
<p>
Review declarations, type assumptions, destructive updates, and implementation-specific dependencies.
</p>
</div>
</div>
<div id="outline-container-org0ade4bd" class="outline-3">
<h3 id="org0ade4bd">175) Portability across CL implementations?</h3>
<div class="outline-text-3" id="text-org0ade4bd">
<p>
Stick to ANSI CL + portability libs; isolate implementation-specific code paths.
</p>
</div>
</div>
<div id="outline-container-orgba5504f" class="outline-3">
<h3 id="orgba5504f">176) What is the role of test strategy in macro-heavy codebases?</h3>
<div class="outline-text-3" id="text-orgba5504f">
<p>
Test at three levels: expansion shape, runtime behavior, and integration semantics.
</p>
</div>
</div>
<div id="outline-container-org5a3edbf" class="outline-3">
<h3 id="org5a3edbf">177) How to document metaprogramming-heavy systems?</h3>
<div class="outline-text-3" id="text-org5a3edbf">
<p>
Document both user-facing forms and generated runtime contracts/invariants.
</p>
</div>
</div>
<div id="outline-container-org9015de0" class="outline-3">
<h3 id="org9015de0">178) What is a good performance workflow for expert Lisp?</h3>
<div class="outline-text-3" id="text-org9015de0">
<p>
Profile first, optimize hottest 5%, verify with benchmarks, re-check correctness invariants.
</p>
</div>
</div>
<div id="outline-container-org9487515" class="outline-3">
<h3 id="org9487515">179) What distinguishes expert Lisp developers?</h3>
<div class="outline-text-3" id="text-org9487515">
<p>
Strong macro discipline, runtime insight, architectural clarity, and pragmatic simplicity.
</p>
</div>
</div>
<div id="outline-container-org677c405" class="outline-3">
<h3 id="org677c405">180) Final mastery advice?</h3>
<div class="outline-text-3" id="text-org677c405">
<p>
Build real systems, read great Lisp code, inspect expansions, and iterate interactively with rigor.
</p>

<hr>

<div class="site-footer">
    <ul class="social-icons">
        <li><a href="https://github.com/bdostumski" rel="nofollow noopener noreferrer"><i class="fab fa-fw fa-github" aria-hidden="true"></i> GitHub</a></li>
        <li><a href="https://www.linkedin.com/in/borislav-dostumski/" rel="nofollow noopener noreferrer"><i class="fab fa-linux" aria-hidden="true"></i> LinkedIn</a></li>
        <li><a href="https://www.youtube.com/@borislavdostumski6006" rel="nofollow noopener noreferrer"><i class="fab fa-linux" aria-hidden="true"></i> YouTube</a></li>
    </ul>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
